/*
データベース演習II 13週目
クラス：IE2A01
制作者：山田　太郎
作成日：2021/04/01
*/

/*
  トリガーを使うことで、特定の動作に対して自動的にSQLを実行することが出来るようになりました。
  課題では、車体管理表を削除した時に自動的に廃車表に登録を行うTRI_BIKEトリガーの作成を行います。
*/

-- 問１：以下の列構造を持つ、廃車表を作成してください。


-- 問２：以下の発動条件と処理を行うTRI_BIKEトリガーを作成してください。


-- 問３：車両番号「00001」のスーパーカブ 50 プロのデータを削除してください。


-- 問４：廃車表のデータを確認してください。


-- 問５：トランザクションの確定をして下さい。


/*
  カーソルを使うことで、複数件のデータに対して１件ずつ処理を行うことが出来るようになりました。
  現在、ピザの商品一覧には原材料の原価合計より安く設定されている商品があります。
  そこで、カーソルを利用したプロシージャを作成して価格の再設定を行います。
*/

-- 問６：カテゴリーがピザの商品情報を表示してください。


-- 問７：カテゴリーがピザである商品ごとの原価合計を表示してください。


-- 問８：以下の仕様に従い、商品一覧の中で原価より安い価格を値上げするPIZZA_PRICEUPプロシージャを作成してください。


-- 問９：PIZZA_PRICEUPプロシージャを実行してください。


-- 問１０：カテゴリーがピザの商品情報を表示してください。


-- 問１１：トランザクションの確定をして下さい。


